In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
# pd.melt is similar to tidyr's gather function

In [2]:
name = ['daniel','john','jane']
trA = [np.NaN, 12, 24]
trB = [42, 31, 27]

In [4]:
df = pd.DataFrame({'name': name, 'treatment A': trA, 'treatment B': trB})
print(df)

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27

In [8]:
# we call pd.melt
melted = pd.melt(frame = df, id_vars='name', 
                 value_vars=['treatment A', 'treatment B'],
                 var_name='treatment', value_name='result') # you can provide column names
print(melted)

     name    treatment  result
0  daniel  treatment A     NaN
1    john  treatment A    12.0
2    jane  treatment A    24.0
3  daniel  treatment B    42.0
4    john  treatment B    31.0
5    jane  treatment B    27.0

In [9]:
print(pd.melt(df, id_vars = 'name')) # if you only provide id_vars, then it will melt all other columns

     name     variable  value
0  daniel  treatment A    NaN
1    john  treatment A   12.0
2    jane  treatment A   24.0
3  daniel  treatment B   42.0
4    john  treatment B   31.0
5    jane  treatment B   27.0

In [1]:
# the df.pivot() method is similar to tidyr's spread function

In [10]:
melted.pivot(index='name', columns = 'treatment', values = 'result')   # note we call pivot on the data frame itself

treatment  treatment A  treatment B
name
daniel             NaN         42.0
jane              24.0         27.0
john              12.0         31.0

In [ ]:
# creating a new variable

In [36]:
print(melted)

     name    treatment  result
0  daniel  treatment A     NaN
1    john  treatment A    12.0
2    jane  treatment A    24.0
3  daniel  treatment B    42.0
4    john  treatment B    31.0
5    jane  treatment B    27.0

In [39]:
# you can create a new variable by defining a new column
melted['gender'] = ['m','m','f','m','m','f']

In [40]:
print(melted)

     name    treatment  result gender
0  daniel  treatment A     NaN      m
1    john  treatment A    12.0      m
2    jane  treatment A    24.0      f
3  daniel  treatment B    42.0      m
4    john  treatment B    31.0      m
5    jane  treatment B    27.0      f

In [36]:
melted.result.astype('str').str[-2:]  # .astype makes a series.
# .str allows for string operators

0    an
1    .0
2    .0
3    .0
4    .0
5    .0
Name: result, dtype: object

In [40]:
melted['trt'] = melted.treatment.str[-1]  # The last letter from the treatment column, as an abreviation for the treatment
print(melted)

     name    treatment  result trt
0  daniel  treatment A     NaN   A
1    john  treatment A    12.0   A
2    jane  treatment A    24.0   A
3  daniel  treatment B    42.0   B
4    john  treatment B    31.0   B
5    jane  treatment B    27.0   B

In [43]:
melted.name.str[:] + " - " +  melted.trt.str[:]

0    daniel - A
1      john - A
2      jane - A
3    daniel - B
4      john - B
5      jane - B
dtype: object

In [45]:
# pd.concat to concatenate tables:
name2 = ['amy','betty','carl']
trA2 = [20, 18, 10]
trB2 = [30, 38, 28]
df2 = pd.DataFrame({'name': name2, 'treatment A': trA2, 'treatment B': trB2})
print(df2)

    name  treatment A  treatment B
0    amy           20           30
1  betty           18           38
2   carl           10           28

In [46]:
print(df)

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27

In [47]:
pd.concat([df, df2])  # call pd.concat. provide it a *list* of data frames, not the dataframe directly
# similar to rbind in R

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27
0     amy         20.0           30
1   betty         18.0           38
2    carl         10.0           28

In [48]:
# when we use pd. concat, the original indexes are kept.
concatenated = pd.concat([df, df2]) 
concatenated.loc[0,]  # returns two rows

     name  treatment A  treatment B
0  daniel          NaN           42
0     amy         20.0           30

In [58]:
print(concatenated.iloc[3:5,])  # iloc is unaffected

    name  treatment A  treatment B
0    amy         20.0           30
1  betty         18.0           38

In [59]:
print(concatenated.iloc[3,])  # iloc is unaffected, # returning only one row reduces to a series

name           amy
treatment A     20
treatment B     30
Name: 0, dtype: object

In [49]:
print(concatenated.index)

Int64Index([0, 1, 2, 0, 1, 2], dtype='int64')

In [66]:
# you can reset the index during the concatenation process with ignore_index = True
concat2 = pd.concat([df, df2], ignore_index = True)
print(concat2)

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27
3     amy         20.0           30
4   betty         18.0           38
5    carl         10.0           28

## importing multiple files with pattern matching
Could be useful if you are downloading several files with similar formats from a website (e.g. one for each month)

In [61]:
import glob  # import this module

In [63]:
filenames = glob.glob('exa*.csv')  # use to find filenames in your working directory that fit the pattern
print(filenames)

['example1.csv', 'example2.csv', 'example3.csv']

In [70]:
list_data = []  # create empty list. This will be a list of dataframes

for file in filenames:
    data = pd.read_csv(file, header = 0)
    data['month'] = file   # append a column with the filename
    list_data.append(data)

In [71]:
print(list_data)  # this is a list of data frames

[   id treatment gender  response         month
0   1         A      F         5  example1.csv
1   2         A      M         3  example1.csv
2   3         A      M         8  example1.csv
3   4         A      F         9  example1.csv
4   5         B      F         1  example1.csv
5   6         B      M         8  example1.csv
6   7         B      F         4  example1.csv
7   8         B      F         6  example1.csv,    id treatment gender  response         month
0   1         A      F         2  example2.csv
1   2         A      M         2  example2.csv
2   3         A      M         2  example2.csv
3   4         A      F         2  example2.csv
4   5         B      F         2  example2.csv
5   6         B      M         2  example2.csv
6   7         B      F         2  example2.csv
7   8         B      F         2  example2.csv,    id treatment gender  response         month
0   1         A      F         3  example3.csv
1   2         A      M         3  example3.csv
2   3         A      M         3  example3.csv
3   4         A      F         3  example3.csv
4   5         B      F         3  example3.csv
5   6         B      M         3  example3.csv
6   7         B      F         3  example3.csv
7   8         B      F         3  example3.csv]

In [72]:
print(list_data[0])
print(type(list_data[0]))

   id treatment gender  response         month
0   1         A      F         5  example1.csv
1   2         A      M         3  example1.csv
2   3         A      M         8  example1.csv
3   4         A      F         9  example1.csv
4   5         B      F         1  example1.csv
5   6         B      M         8  example1.csv
6   7         B      F         4  example1.csv
7   8         B      F         6  example1.csv
<class 'pandas.core.frame.DataFrame'>

In [73]:
pd.concat(list_data, ignore_index = True)  # to make a single dataframe, we use pd.concat over the list of dataframes

    id treatment gender  response         month
0    1         A      F         5  example1.csv
1    2         A      M         3  example1.csv
2    3         A      M         8  example1.csv
3    4         A      F         9  example1.csv
4    5         B      F         1  example1.csv
5    6         B      M         8  example1.csv
6    7         B      F         4  example1.csv
7    8         B      F         6  example1.csv
8    1         A      F         2  example2.csv
9    2         A      M         2  example2.csv
10   3         A      M         2  example2.csv
11   4         A      F         2  example2.csv
12   5         B      F         2  example2.csv
13   6         B      M         2  example2.csv
14   7         B      F         2  example2.csv
15   8         B      F         2  example2.csv
16   1         A      F         3  example3.csv
17   2         A      M         3  example3.csv
18   3         A      M         3  example3.csv
19   4         A      F         3  example3.csv
20   5         B      F         3  example3.csv
21   6         B      M         3  example3.csv
22   7         B      F         3  example3.csv
23   8         B      F         3  example3.csv

In [77]:
name = ['daniel','john','jane']
trA = [np.NaN, 12, 24]
trB = [42, 31, 27]
dfleft = pd.DataFrame({'name': name, 'treatment A': trA, 'treatment B': trB})
print(dfleft)

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27

In [78]:
name = ['john','max','jane']
trC = [0, 12, 24]
trD = [42, 31, 27]
dfright = pd.DataFrame({'patient': name, 'treatment C': trC, 'treatment D': trD})
print(dfright)

  patient  treatment C  treatment D
0    john            0           42
1     max           12           31
2    jane           24           27

In [80]:
dfleft.merge(dfright, left_on = 'name', right_on = 'patient')  # inner join, will return only rows that exist in both

   name  treatment A  treatment B patient  treatment C  treatment D
0  john         12.0           31    john            0           42
1  jane         24.0           27    jane           24           27

In [81]:
dfleft.merge(dfright, left_on = 'name', right_on = 'patient', how = 'left')  
# left join, will return all the rows in the left table and rows from the right table that matches

     name  treatment A  treatment B patient  treatment C  treatment D
0  daniel          NaN           42     NaN          NaN          NaN
1    john         12.0           31    john          0.0         42.0
2    jane         24.0           27    jane         24.0         27.0

In [82]:
dfleft.merge(dfright, left_on = 'name', right_on = 'patient', how = 'right')  
# right join, will return all the rows in the right table and rows from the left table that matches

   name  treatment A  treatment B patient  treatment C  treatment D
0  john         12.0         31.0    john            0           42
1  jane         24.0         27.0    jane           24           27
2   NaN          NaN          NaN     max           12           31

In [83]:
dfleft.merge(dfright, left_on = 'name', right_on = 'patient', how = 'outer')  
# all rows from both tables

     name  treatment A  treatment B patient  treatment C  treatment D
0  daniel          NaN         42.0     NaN          NaN          NaN
1    john         12.0         31.0    john          0.0         42.0
2    jane         24.0         27.0    jane         24.0         27.0
3     NaN          NaN          NaN     max         12.0         31.0

In [84]:
merged = dfleft.merge(dfright, left_on = 'name', right_on = 'patient', how = 'outer')  
print(merged)

     name  treatment A  treatment B patient  treatment C  treatment D
0  daniel          NaN         42.0     NaN          NaN          NaN
1    john         12.0         31.0    john          0.0         42.0
2    jane         24.0         27.0    jane         24.0         27.0
3     NaN          NaN          NaN     max         12.0         31.0

In [86]:
name = ['daniel','john','jane']
trA = [np.NaN, 12, 24]
trB = [42, 31, 27]
dfleft = pd.DataFrame({'name': name, 'treatment A': trA, 'treatment B': trB})
print(dfleft)

     name  treatment A  treatment B
0  daniel          NaN           42
1    john         12.0           31
2    jane         24.0           27

In [88]:
name = ['daniel','daniel','john','john']
parents = ['mom','dad','mama','papa']
dfright = pd.DataFrame({'name': name, 'parents': parents})
print(dfright)

     name parents
0  daniel     mom
1  daniel     dad
2    john    mama
3    john    papa

In [90]:
dfleft.merge(dfright, on = 'name')  # a one-to-many inner join
# returns only rows that match in left and right
# for rows that appear multiple times in the right
# the contents in the left gets duplicated

     name  treatment A  treatment B parents
0  daniel          NaN           42     mom
1  daniel          NaN           42     dad
2    john         12.0           31    mama
3    john         12.0           31    papa